International Conferences:
1.  E. Poornima, C. Shoba Bindu, S.K Munwar, “Detection and Prevention of Layer-3 Wormhole Attacks on Boundary State Routing in AdHoc Networks”, International Conference on Advances in Computer Engineering, June 20-June 21, 2010, Bangalore, India. (SCOPUS)
2.  E. Poornima, N. Kasiviswanath, C. Shoba Bindu, “Secure Data Sharing for Multiple Dynamic Groups in Cloud”, 2015 Conference on Power, Control, Communication and Computational Technologies for Sustainable Growth (PCCCTSG), 11-12 December 2015, G. Pulla Reddy Engineering College, Kurnool. (SCOPUS)
3.  E.Poornima E., Kasiviswanath N., Shoba Bindu C. (2019) Secured Data Sharing in Groups Using Attribute-Based Broadcast Encryption in Hybrid Cloud. In Emerging Trends in Expert Applications and Security. Advances in Intelligent Systems and Computing, vol 841. Springer, Singapore, https://doi.org/10.1007/978-981-13-2285-3_83, Proceedings of International Conference on Expert Applications & Security (ICETEAS2018), Feb 17-18, 2018, Jaipur Engineering College And Research Centre. (SCOPUS)
4. Poornima, E., et al. "A Real-Time IoT-based Model to Detect and Alert Security Guards' Drowsiness." E3S Web of Conferences. Vol. 391. 2023..
5. Poornima, E., Mohit, S., Reddy, K. C., Hemchandra, V., Chandramauli, A., & Rao, P. K. (2023). Deep Generative Models for Automated Dehazing Remote Sensing Satellite Images. In E3S Web of Conferences (Vol. 430, p. 01024). EDP Sciences.
6. Kalpana, K., Reddy, M. B., Sailani, S., Poornima, E., & Chaudhary, P. (2023). Design and Fabrication of staircase elevator with lead screw mechanism for elderly people. In E3S Web of Conferences (Vol. 430, p. 01144). EDP Sciences.
7. Poornima, E., Mamatha, P., Krishnamai, M., Sruthi, C., Shah, S. K., & Kumar, L. R. (2023). Automated Early Phase Breast Cancer Detection using Hybrid Machine Learning Algorithms. In E3S Web of Conferences (Vol. 430, p. 01035). EDP Sciences.
8. Poornima, E., Abhishek, G., Haran, K. S. R. H., Kumar, B. R., & Faizan, R. (2023). Feasible Trend Prediction for 2019 Indian General Elections. In E3S Web of Conferences (Vol. 430, p. 01048). EDP Sciences.
9. Poornima Ediga, Pravalika Gullapelly, Tejaswi Edukulla, Kaavya Nunna, Mohammed Al-Farouni, Revathi V, Navdeep Singh and Ashwani Kumar,” Promoting sustainable living: IoT-integrated smart homes for elderly people” E3S Web of Conf., 507 (2024) 01033  DOI: https://doi.org/10.1051/e3sconf/202450701033
10. Mohammad Q, Gopal K, Poornima E, Navdeep Singh, Vandana Arora Sethi and Vandna Kumari” Aluminum-Alumina Composite Manufacturing: Unlocking Potential with Friction Stir Processing”E3S Web of Conf., 507 (2024) 01034 DOI: https://doi.org/10.1051/e3sconf/202450701034
11. Poornima Ediga, Hansika Cheemakurthy, Mokshagna Kaslavada, Manu Hajari, Haider Alabdeli, Revathi V, Manish Gupta and Bhishm Pratap” Smart Cultivation with IoT Monitoring and Fertilizer Recommendation System with Climatic Conditions” E3S Web of Conf., 507 (2024) 01054 DOI: https://doi.org/10.1051/e3sconf/202450701054
12. Hazim Y. Saeed, Rashi Khubnani, Poornima Ediga, Manish Gupta, Rajeev Kumar and Ravi Kalra” Buckling Analysis of Vertical Structures: A Comprehensive Finite Element Study” E3S Web of Conf., 507 (2024) 01055 DOI: https://doi.org/10.1051/e3sconf/202450701055
13. Oleg Igorevich Rozhdestvenskiy and E. Poornima” Enabling Sustainable Urban Transportation with Predictive Analytics and IoT”MATEC Web Conf., 392 (2024) 01179 DOI: https://doi.org/10.1051/matecconf/202439201179
14. Lavish Kansal and Poornima Ediga” IoT-Enabled predictive maintenance for sustainable transportation fleets”MATEC Web Conf., 392 (2024) 01189DOI: https://doi.org/10.1051/matecconf/202439201189.
15. Abhishek  Saxena, Rajesh  Gundlapalle, Manish  Gupta, Ediga  Poornima, Harjeet  Singh, Ali  Albawi, K  Arunkumar”Hybrid Wind-Solar System with UPQC”E3S Web Conf. 552 01127 (2024)DOI: 10.1051/e3sconf/202455201127
16. Bisht, Yashwant & Poornima, Ediga & Aysola, Sai & Sood, Saksham & Balassem, Zaid & Kumar, Sourabh & Cajla, Pancham & Khandelwal, Utkal. (2024). Hybrid Renewable Energy System Design using Multi-Objective Optimization. E3S Web of Conferences. 581. 10.1051/e3sconf/202458101036
17. P. Tharcis, S. O. Husain, B. Buvaneswari, E. Poornima and N. K. Sundaram, "A Marine Traffic Pattern Prediction System using Graph Attention Network and Bi-directional Long Short-Term Memory Network," 2024 First International Conference on Software, Systems and Information Technology (SSITCON), Tumkur, India, 2024, pp. 1-5, doi: 10.1109/SSITCON62437.2024.10796446.
18. S. Padmakala, S. O. Husain, E. Poornima, P. Dutta and M. Soni, "Hyperparameter Tuning of Deep Convolutional Neural Network for Hand Gesture Recognition," 2024 Second International Conference on Networks, Multimedia and Information Technology (NMITCON), Bengaluru, India, 2024, pp. 1-4, doi: 10.1109/NMITCON62075.2024.10698984.
19. M. Jayanthi, P. S. Srimani, M. Mittal, M. Gupta, E. Poornima and T. M. K. Al-Rubaye, "The Role of Stream Data in Modern Geology and Earth Science Research," 2024 1st International Conference on Sustainable Computing and Integrated Communication in Changing Landscape of AI (ICSCAI), Greater Noida, India, 2024, pp. 1-7, doi: 10.1109/ICSCAI61790.2024.10866622.
20. J. Ranjith, M. Al-Farouni, R. Anitha, E. Poornima, K. Sharma and N. S. Kumar, "Deep Reinforcement Learning for Dynamic Compliance Management in Blockchain Supply Chains: An LSTM Perspective," 2024 International Conference on IoT, Communication and Automation Technology (ICICAT), Gorakhpur, India, 2024, pp. 1196-1200, doi: 10.1109/ICICAT62666.2024.10923083.




International Journals:
1. E. Poornima, C. Shoba Bindu, “Prevention of Wormhole Attacks in Geographic Routing Protocol”, International Journal of Computer Network and Security (IJCNS), ISSN : 0975-8283 Vol. 3 No. 1, 2011 pp. 42-50
2. E.Poornima , N.Kasiviswanath, C. Shoba Bindu “ADaas: A Secure Attribute Based Group Signature based Agri-Cloud Framework” International Journal of Advanced Intelligence Paradigms), Inderscience Publishers, ISSN :1755-0386 (UGC Approved Journal No: 2498) (SCOPUS) Cite Score: 0.62. http://www.inderscience.com/info/ingeneral/forthcoming.php?jcode=ijaip (In Press) LBSS and IACSIT.
3. E. Poornima, N. Kasiviswanath, C. Shoba Bindu, “Key Security Issues and Existing Solutions in Cloud Computing Applications,” Indian Journal of Science and Technology, ISSN (Online): 0974-564, Vol 10(19), DOI: 10.17485/ijst/2017/v10i19/111016, May 2017, pp.1-7.(IC Value : 5.02)(WOS)
4.  Poornima E, Sasikala C, Vijayakumar Peroumal," A Secured Data Sharing Framework for Dynamic Groups using an Attribute-based Cryptography in Public cloud: Agri-Cloud"International Journal of Electronic Security and Digital Forensics, ISSN online:1751-9128, (SCOPUS) Cite Score:2.2,DOI: 10.1504/IJESDF.2022.10043341, https://www.inderscience.com/info/ingeneral/forthcoming.php?jcode=ijesdf.(Scopus,ESCI)
5.  Saravanakumar R,Pradeep Bedi,Poornima E"IoB:Sensors for Wearable Monitoring and Enhancing Health Care Systems"IEEE TRANSACTIONS ON INSTRUMENTATION AND MEASUREMENT, ISSN / eISSN: 0018-9456 / 1557-9662,Cite Score:6.1  (SCIE)
6. E.Poornima,C.Shashikala  “Implementation Of Hybrid Machine Learning Technique For Intrusion Detection System In Cloud Computing" International Journal of Early Childhood Special Education (INT-JECSE),April 2022 DOI: 10.9756/INT-JECSE/V14I2.128. (ESCI+Scopus) 
7.  B. Lanitha, E. Poornima, R. Sudha, D. Beulah David, K. Kannan, R. Jegan, Vijayakumar Peroumal, R. Kirubagharan, Meroda Tesfaye, "IoT Enabled Sustainable Automated Greenhouse Architecture with Machine Learning Module", Journal of Nanomaterials, vol. 2022, Article ID 1314903, 6 pages, 2022. https://doi.org/10.1155/2022/1314903 (SCIE)
8. E. Poornima, “Fog Robotics-based Intelligence Transportation System using Line-of-sight Intelligent Transportation”, Multimedia Tools and Applications, vol. 1231, March, 2023, https://doi.org/10.1007/s11042-023-15086-6
9. [E. Poornima, FTOR-Mod PSO: A Fault Tolerance and an Optimal Relay Node Selection Algorithm for Wireless Sensor Networks using Modified PSO, Knowledge-Based Systems, vol. 272, no. 110583, April, 2023, https://doi.org/10.1016/j.knosys.2023.110583.
10. [10]E. Poornima, “A Generic Framework for Sharing Data using Attribute-based Cryptography in Hybrid Cloud,” International Journal of Intelligent Systems and Applications in Engineering, vol. 10, no. 4, pp. 634-640, December, 2022.
11. P. Sreedevi, Ajmeera Kiran, T. Santhi Sri, E. Poornima, Sanjeeva Polepaka, Y. Supriya Reddy,Da-resbigru -brain tumor classification using Dual attention residual bi directional gated recurrent unit using MRI images,Biomedical Signal Processing and Control,Volume 88, Part A,2024,105596,ISSN 1746-8094,https://doi.org/10.1016/j.bspc.2023.105596.
12. Ganesh, A., Divya, K. S., Sasikala, C., Poornima, E., Nidamanuru, S. R., Sujith, A. V. L. N., & Gajula, R. (2024). Optimizing Task Scheduling: Exploring Advanced Machine Learning in Dew-Powered Cloud Environments. Scalable Computing: Practice and Experience, 25(5), 3701-3714.https://doi.org/10.1080/23311916.2024.2390674 
13. G, K., Ediga, P., S, A., P, A., T, S., Mittal, A., … Habelalmateen, M. I. (2024). Smart energy management: real-time prediction and optimization for IoT-enabled smart homes. Cogent Engineering, 11(1). https://doi.org/10.1080/23311916.2024.2390674
14.  Chavan, S. A., et al. "ML Based Prediction Model Using Arima for Climatic Dataset for Marathwada Region of Maharashtra." Advancements in Science and Technology for Healthcare, Agriculture, and Environmental Sustainability. CRC Press, 2024. 134-143.




                                    Book Chapters
1. Rahi, P., Kuzhaloli, S., Poornima, E., Chakravarthi, D., & Vijayakumar, P. (2023). Designing and Modeling of Crowdsourcing for Optimizing the Public Healthcare Informatics System in Society 5.0. In Editor(s) of the book (Eds.), Contemporary Applications of Data Fusion for Advanced Healthcare Informatics (pp. 300). Publisher. DOI: 10.4018/978-1-6684-8913-0
2.  Samikannu, R., Koshariya, A. K., Poornima, E., Ramesh, S., Kumar, A., & Boopathi, S. (2023). Sustainable Development in Modern Aquaponics Cultivation Systems Using IoT Technologies. In Human Agro-Energy Optimization for Business and Industry (pp. 105-127). IGI global.
3. Dr. Pogula Sreedev,i Dr. T. Santhi Sri, Dr. E. Poornima, Dr. Farooq Sunar Mahammad,"IMPROVE FAULT DETECTION AND SENSOR ROUTING PROBLEMS WITH NAIVE BAYES CLASSIFIER AND DATA AGGREGATION APPROACH", Futuristic Trends in IOT Volume 3 Book 6,IIP Series, Volume 3, May, 2024, Page no.168-179, e-ISBN: 978-93-6252-967-1, DOI/Link: https://www.doi.org/10.58532/V3BBIO6P2CH4
4. Rajani, D., Dutt, A., Abood, A., Mahenderreddy, M., & Poornima, E. (2025). Exploring the Short Virtual Reality to Deliver the Natural Experience During the Working Days. In R. Bansal & R. Lampou (Eds.), Optimizing Virtual Reality and Metaverse for Remote Work and Virtual Team Collaboration (pp. 49-66). IGI Global. https://doi.org/10.4018/979-8-3693-6839-8.ch003
5. Kumar, S., Rajani, D., Dutt, A., Poornima, E., & Reddy, M. M. (2025). Emphasizing the Environmental Issue by Machine Learning-Based Sentiment Analysis. In R. Bansal, F. Rabby, R. Sharma, D. Parwani, & A. Gupta (Eds.), Text Mining and Sentiment Analysis in Climate Change and Environmental Sustainability (pp. 19-38). IGI Global Scientific Publishing. https://doi.org/10.4018/979-8-3693-7230-2.ch002


PATENTS
Grant
[1] Patent number: 2020103319
E., Poornima "To Transmit e-Medical Records for Sharing on Blockchain using Homomorphic Encryption Methods"  Patent granted on 23 December 2020.
[2] DrE.Poornima, Associate Professor, G.Pulla Reddy Engineering College, Design No. 344842-001,, Published journal date: 30/07/2021
 
Text Book
[1] Title: Introduction to Cloud Computing;ISBN: 819524598-6,South Asian Publications
[2] Computer Networks , LIBRO INTERNATIONAL PUBLISHERS,978-81-971392-9-1